#!/usr/bin/env python
# coding: utf-8

# In[131]:


import numpy as np
a=np.array([
    ("Терминатор","Фантастика",1984,10,4.6),
    ("Крепкий орешек","Боевик",1988,23,3.7),
    ("9 рота","Военный",2005,15,4.0),
    ("Такси","Комедия",1998,30,3.9),
    ("Пятый элемент","Фантастика",1997,7,3.5),
    ("Человек-паук: Нет пути домой","фантастика",2021,30,4.6),
    ("Джокер","Криминал",2019,50,5.0),
    ("Побег из Шоушенка","Драма",1994,45,4.9),
    ("Один дома","Комедия",1990,35,4.7),
    ("Зеленая миля","Драма",1990,39,4.3)],
    dtype=[("name", "U25"), ("genre", "U25"),("year", "i4"),("quantity", "i4"),("argquantity", "f8")])


# <h7>Создаю копию для изменения столбца с оценками<h7>

# In[133]:


new_a=a.copy()


# In[134]:


new_a


# In[135]:


new_a[:]["argquantity"]=new_a[:]["argquantity"]*2


# In[136]:


new_a


# <h7>Создаю еще одну копию списка для дальнейшей удобной работы для практики с 4 урока<h7>

# In[158]:


a2=np.array([['Терминатор','Фантастика',1984,10,4.6],
    ['Крепкий орешек','Боевик',1988,23,3.7],
    ['9 рота','Военный',2005,15,4.0],
    ["Такси","Комедия",1998,30,3.9],
    ["Пятый элемент","Фантастика",1997,7,3.5],
    ["Человек-паук: Нет пути домой","фантастика",2021,30,4.6],
    ["Джокер","Криминал",2019,50,5.0],
    ["Побег из Шоушенка","Драма",1994,45,4.9],
    ["Один дома","Комедия",1990,35,4.7],
    ["Зеленая миля","Драма",1990,39,4.3]])
a2


# In[177]:


b=np.random.randint(90,180,size=10).reshape(10,1)
b
c = np.concatenate((a2, b), axis=1)
c


# In[186]:


np.savetxt('moves.txt',c,fmt='%s', delimiter='\t')


# In[188]:


moves=np.loadtxt('moves.txt',delimiter='\t', dtype=str)


# In[192]:


moves[:, 2:10] = moves[:, 2:10].astype(float)

print(moves)


# In[ ]:




